"""Task 3: Эния
Неспокойно сейчас на стапелях шестого дока межгалактического порта планеты Торна.
Всего через месяц закончится реконструкция малого броненесущего корвета “Эния”.
И снова этому боевому кораблю и его доблестной команде предстоят тяжелые бои
за контроль над плутониевыми рудниками Сибелиуса. Работа не прекращается ни на секунду,
лазерные сварочные аппараты работают круглые сутки.
От непрерывной работы плавятся шарниры роботов-ремонтников.
Но задержаться нельзя ни на секунду.
И вот в этой суматохе обнаруживается, что термозащитные панели корвета вновь требуют срочной обработки сульфидом тория.

Известно, что на обработку одного квадратного метра панели требуется 1 нанограмм сульфида.
Всего необходимо обработать N прямоугольных панелей размером A на B метров.
Вам необходимо как можно скорее подсчитать, сколько всего сульфида необходимо на обработку всех панелей “Энии”.
И не забудьте, что панели требуют обработки с обеих сторон.

Входные данные
Пользователь вводит 3 целых положительных числа N (N ≤ 100), A (A ≤ 100), B (B ≤ 100)
Выходные данные
Нужно вывести единственное число – вес необходимого для обработки
сульфида тория в нанограммах.
"""


quantity = int(input("Введите кол-во панелей: "))
length = int(input("Введите длину панели: "))
width = int(input("Введите ширину панели: "))


result = length * width * quantity * 2
print("Вам понадобится", result, "нг сульфида тория")
